<a href="https://colab.research.google.com/github/Lee-Minsoo-97/Python-Handbook/blob/main/Pandas_Overview.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## What is Pandas?

An open-source Python library developed by Wes McKinney in 2008 <br>
The name is derived from: **PAN**el **DA**ta <br>
Pandas is built **ON TOP** of another powerful Python library called **NumPY** that was developed around 2005<br>
If you want to be an analytics professional - this is the Python library to master!!!
<br>
<br>
### How do I start working with Pandas?

1. If you installed Anaconda to your computer - you already have Pandas!!!
2. If you work on Google Colab - you already have Pandas!!!
<br>
"Already have" = it's installed on your computer.<br>

> But to work with it in your current notebook, you must tell Python that you want to work with it.  We do this using **IMPORT** statements.

> How do I learn more about Pandas? <br>
Go to:
https://pandas.pydata.org/docs/index.html

# read_csv()

In [ ]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [ ]:
ls

Canvas/                customer_churn.csv     nba.csv
Pandas_Overview.ipynb  data.csv               pivot_data.csv
Python Modules.ipynb   data.xlsx
Week2.ipynb            data2.csv

In [ ]:
df = pd.read_csv('data2.csv')

> when we run the code above - we don't get any errors, but the resulting dataframe is not what we want.  We don't have variable names and our data doesn't show up until row 4 of the dataframe.  <br><br>
> We fix this by doing noting that our data file contains some descriptive documentation at the top.  The actualy data doesn't start until row 4.  To accommodate this using read_csv() we just add the "skiprows=" argument as seen below.

In [ ]:
df = pd.read_csv('data2.csv',skiprows=3)

> Now the data should look right - with variable names at the top and no missing rows of data at the top.

In [ ]:
df_xl = pd.read_excel('data.xls',sheet_name='OtherData')

In [ ]:
df_xl.shape

(19, 9)

## How to read a tabular data file into pandas?

Some free data sources:<br>
http://bit.ly/chiporders <br>
http://bit.ly/movieusers

In [ ]:
order_df = pd.read_table('http://bit.ly/chiporders')

In [ ]:
order_df.tail()

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [ ]:
user_cols = ['user_id','age','gender','job','zipcode']

user_df = pd.read_table('http://bit.ly/movieusers',
              sep='|',
              header=None,
              names=user_cols
             )

In [ ]:
user_df.head()

   user_id  age gender         job zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213